# US - Baby Names

#### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

#### Step 2. Import the dataset from this address.

#### Step 3. Assign it to a variable called baby_names.

In [3]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

baby_names = pd.read_csv(url)

#### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

#### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [9]:
del baby_names['Unnamed: 0']
del baby_names['Id']

In [11]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

#### Step 6. Is there more male or female names in the dataset?

In [15]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

#### Step 7. Group the dataset by name and assign to names

In [32]:
del baby_names['Year']
names = baby_names.groupby('Name')

#### Step 8. How many different names exist in the dataset?

In [33]:
names.count()

         Gender  State  Count
Name
Aaban         2      2      2
Aadan         4      4      4
Aadarsh       1      1      1
Aaden       196    196    196
Aadhav        1      1      1
...         ...    ...    ...
Zyra          7      7      7
Zyrah         2      2      2
Zyren         1      1      1
Zyria        10     10     10
Zyriah        9      9      9

[17632 rows x 3 columns]

#### Step 9. What is the name with most occurrences?

In [36]:
names.sum().sort_values(by='Count', ascending=False).iloc[0]

# names.sum().Count.idxmax()

Count    242874
Name: Jacob, dtype: int64

#### Step 10. How many different names have the least occurrences?

In [79]:
names_group = names.sum()

filt = names_group['Count'] == names_group.Count.min()
res = names_group[filt]
len(res)

2578

#### Step 11. What is the median name occurrence?

In [88]:
filt = names_group['Count'] == names_group['Count'].median()
names_group[filt]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

#### Step 12. What is the standard deviation of names?

In [98]:
names_group.std()

Count    11006.069468
dtype: float64

#### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [100]:
names_group.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000